### Report for step_function on environment: dev

#### Terraform Format and Style 🖌`success`
<details><summary>Format Output</summary>

```


```

</details>

#### Terraform Initialization ⚙️`success`
<details><summary>Initialization Output</summary>

```

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing provider plugins...
- Finding hashicorp/aws versions matching "~> 6.0"...
- Installing hashicorp/aws v6.27.0...
- Installed hashicorp/aws v6.27.0 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

```

</details>

#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan (47 to add, 0 to change, 0 to destroy)</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.dashboard_pipeline_trigger will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "dashboard_pipeline_trigger" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "states:StartExecution",
            ]
          + resources = [
              + (known after apply),
            ]
          + sid       = "TriggerStepFunction"
        }
    }

  # data.aws_iam_policy_document.reports_generator_trigger will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "reports_generator_trigger" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "states:StartExecution",
            ]
          + resources = [
              + (known after apply),
            ]
          + sid       = "TriggerStepFunction"
        }
    }

  # data.aws_iam_policy_document.spine_exporter_and_transfer_classifier_trigger will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "spine_exporter_and_transfer_classifier_trigger" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "states:StartExecution",
            ]
          + resources = [
              + (known after apply),
            ]
          + sid       = "TriggerStepFunction"
        }
    }

  # aws_cloudwatch_dashboard.data_pipeline will be created
  + resource "aws_cloudwatch_dashboard" "data_pipeline" {
      + dashboard_arn  = (known after apply)
      + dashboard_body = (sensitive value)
      + dashboard_name = "dev-registrations-data-pipeline-overview"
      + id             = (known after apply)
      + region         = "eu-west-2"
    }

  # aws_cloudwatch_event_rule.run_daily_5am_cron_expression will be created
  + resource "aws_cloudwatch_event_rule" "run_daily_5am_cron_expression" {
      + arn                 = (known after apply)
      + description         = "Eventbridge Event Rule that triggers the Daily Spine Export and Transfer Classifier Step function 5:37am every morning"
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "dev-run-data-pipeline-step-functions-daily-5-30am"
      + name_prefix         = (known after apply)
      + region              = "eu-west-2"
      + schedule_expression = "cron(37 5 * * ? *)"
      + tags                = {
          + "ApplicationRole"     = "AwsCloudwatchEventRule"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-eventbridge-event-rule"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + tags_all            = {
          + "ApplicationRole"     = "AwsCloudwatchEventRule"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-eventbridge-event-rule"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
    }

  # aws_cloudwatch_event_rule.run_daily_7am_cron_expression will be created
  + resource "aws_cloudwatch_event_rule" "run_daily_7am_cron_expression" {
      + arn                 = (known after apply)
      + description         = "Eventbridge Event Rule that triggers the Reports Generator Step function 7am every morning"
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "dev-run-data-pipeline-step-functions-daily-7am"
      + name_prefix         = (known after apply)
      + region              = "eu-west-2"
      + schedule_expression = "cron(0 7 * * ? *)"
      + tags                = {
          + "ApplicationRole"     = "AwsCloudwatchEventRule"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-eventbridge-event-rule"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + tags_all            = {
          + "ApplicationRole"     = "AwsCloudwatchEventRule"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-eventbridge-event-rule"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
    }

  # aws_cloudwatch_event_rule.run_once_a_month_on_15th_cron_expression will be created
  + resource "aws_cloudwatch_event_rule" "run_once_a_month_on_15th_cron_expression" {
      + arn                 = (known after apply)
      + description         = "Eventbridge Event Rule that triggers the Reports Generator Step Function and Dashboard Pipeline Step Function at 7am every month on the 15th"
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "dev-run-data-pipeline-step-functions-every-month-15th-7am"
      + name_prefix         = (known after apply)
      + region              = "eu-west-2"
      + schedule_expression = "cron(0 7 15 * ? *)"
      + state               = "ENABLED"
      + tags                = {
          + "ApplicationRole"     = "AwsCloudwatchEventRule"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-eventbridge-event-rule"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + tags_all            = {
          + "ApplicationRole"     = "AwsCloudwatchEventRule"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-eventbridge-event-rule"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
    }

  # aws_cloudwatch_event_rule.run_once_a_week_on_monday_cron_expression will be created
  + resource "aws_cloudwatch_event_rule" "run_once_a_week_on_monday_cron_expression" {
      + arn                 = (known after apply)
      + description         = "Eventbridge Event Rule that triggers the Reports Generator Step Function at 7am every monday"
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "dev-run-data-pipeline-step-functions-every-week-month-7am"
      + name_prefix         = (known after apply)
      + region              = "eu-west-2"
      + schedule_expression = "cron(0 7 ? * 2 *)"
      + state               = "ENABLED"
      + tags                = {
          + "ApplicationRole"     = "AwsCloudwatchEventRule"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-eventbridge-event-rule"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + tags_all            = {
          + "ApplicationRole"     = "AwsCloudwatchEventRule"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-eventbridge-event-rule"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
    }

  # aws_cloudwatch_event_target.daily_transfer_details_by_hour_report_event_trigger will be created
  + resource "aws_cloudwatch_event_target" "daily_transfer_details_by_hour_report_event_trigger" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + input          = jsonencode(
            {
              + ALERT_ENABLED            = "false"
              + CONVERSATION_CUTOFF_DAYS = "0"
              + NUMBER_OF_DAYS           = "1"
              + REPORT_NAME              = "TRANSFER_DETAILS_BY_HOUR"
              + SEND_EMAIL_NOTIFICATION  = "true"
            }
        )
      + region         = "eu-west-2"
      + role_arn       = (known after apply)
      + rule           = "dev-run-data-pipeline-step-functions-daily-7am"
      + target_id      = "dev-daily-reports-details-by-hour-trigger"
    }

  # aws_cloudwatch_event_target.daily_transfer_level_technical_failures_report_event_trigger will be created
  + resource "aws_cloudwatch_event_target" "daily_transfer_level_technical_failures_report_event_trigger" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + input          = jsonencode(
            {
              + ALERT_ENABLED            = "false"
              + CONVERSATION_CUTOFF_DAYS = "0"
              + NUMBER_OF_DAYS           = "1"
              + REPORT_NAME              = "TRANSFER_LEVEL_TECHNICAL_FAILURES"
              + SEND_EMAIL_NOTIFICATION  = "true"
            }
        )
      + region         = "eu-west-2"
      + role_arn       = (known after apply)
      + rule           = "dev-run-data-pipeline-step-functions-daily-7am"
      + target_id      = "dev-daily-reports-transfer-level-technical-failures-trigger"
    }

  # aws_cloudwatch_event_target.daily_transfer_outcomes_per_supplier_pathway_report_event_trigger will be created
  + resource "aws_cloudwatch_event_target" "daily_transfer_outcomes_per_supplier_pathway_report_event_trigger" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + input          = jsonencode(
            {
              + ALERT_ENABLED            = "true"
              + CONVERSATION_CUTOFF_DAYS = "0"
              + NUMBER_OF_DAYS           = "1"
              + REPORT_NAME              = "TRANSFER_OUTCOMES_PER_SUPPLIER_PATHWAY"
              + SEND_EMAIL_NOTIFICATION  = "true"
            }
        )
      + region         = "eu-west-2"
      + role_arn       = (known after apply)
      + rule           = "dev-run-data-pipeline-step-functions-daily-7am"
      + target_id      = "dev-daily-reports-generator-transfer-outcomes-trigger"
    }

  # aws_cloudwatch_event_target.event_trigger will be created
  + resource "aws_cloudwatch_event_target" "event_trigger" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + region         = "eu-west-2"
      + role_arn       = (known after apply)
      + rule           = "dev-run-data-pipeline-step-functions-daily-5-30am"
      + target_id      = "dev-daily-spine-exporter-and-transfer-classifier-trigger"
    }

  # aws_cloudwatch_event_target.monthly_dashboard_pipeline_event_trigger will be created
  + resource "aws_cloudwatch_event_target" "monthly_dashboard_pipeline_event_trigger" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + input          = jsonencode(
            {
              + SKIP_METRICS = false
            }
        )
      + region         = "eu-west-2"
      + role_arn       = (known after apply)
      + rule           = "dev-run-data-pipeline-step-functions-every-month-15th-7am"
      + target_id      = "dev-monthly-dashboard-pipeline-trigger"
    }

  # aws_cloudwatch_event_target.monthly_sicbl_level_integration_times_report_event_trigger will be created
  + resource "aws_cloudwatch_event_target" "monthly_sicbl_level_integration_times_report_event_trigger" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + input          = jsonencode(
            {
              + ALERT_ENABLED            = "false"
              + CONVERSATION_CUTOFF_DAYS = "14"
              + NUMBER_OF_MONTHS         = "1"
              + REPORT_NAME              = "SUB_ICB_LOCATION_LEVEL_INTEGRATION_TIMES"
              + SEND_EMAIL_NOTIFICATION  = "true"
            }
        )
      + region         = "eu-west-2"
      + role_arn       = (known after apply)
      + rule           = "dev-run-data-pipeline-step-functions-every-month-15th-7am"
      + target_id      = "dev-monthly-reports-generator-sicbl-level-integr-trigger"
    }

  # aws_cloudwatch_event_target.monthly_transfer_outcomes_per_supplier_pathway_report_event_trigger will be created
  + resource "aws_cloudwatch_event_target" "monthly_transfer_outcomes_per_supplier_pathway_report_event_trigger" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + input          = jsonencode(
            {
              + ALERT_ENABLED            = "false"
              + CONVERSATION_CUTOFF_DAYS = "14"
              + NUMBER_OF_MONTHS         = "1"
              + REPORT_NAME              = "TRANSFER_OUTCOMES_PER_SUPPLIER_PATHWAY"
              + SEND_EMAIL_NOTIFICATION  = "true"
            }
        )
      + region         = "eu-west-2"
      + role_arn       = (known after apply)
      + rule           = "dev-run-data-pipeline-step-functions-every-month-15th-7am"
      + target_id      = "dev-monthly-reports-generator-transfer-outcomes-trigger"
    }

  # aws_cloudwatch_event_target.weekly_transfer_details_by_hour_report_event_trigger will be created
  + resource "aws_cloudwatch_event_target" "weekly_transfer_details_by_hour_report_event_trigger" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + input          = jsonencode(
            {
              + ALERT_ENABLED            = "false"
              + CONVERSATION_CUTOFF_DAYS = "2"
              + NUMBER_OF_DAYS           = "7"
              + REPORT_NAME              = "TRANSFER_DETAILS_BY_HOUR"
              + SEND_EMAIL_NOTIFICATION  = "true"
            }
        )
      + region         = "eu-west-2"
      + role_arn       = (known after apply)
      + rule           = "dev-run-data-pipeline-step-functions-every-week-month-7am"
      + target_id      = "dev-weekly-reports-generator-transfer-hourly-trigger"
    }

  # aws_cloudwatch_event_target.weekly_transfer_level_technical_failures_report_event_trigger will be created
  + resource "aws_cloudwatch_event_target" "weekly_transfer_level_technical_failures_report_event_trigger" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + input          = jsonencode(
            {
              + ALERT_ENABLED            = "false"
              + CONVERSATION_CUTOFF_DAYS = "2"
              + NUMBER_OF_DAYS           = "7"
              + REPORT_NAME              = "TRANSFER_LEVEL_TECHNICAL_FAILURES"
              + SEND_EMAIL_NOTIFICATION  = "true"
            }
        )
      + region         = "eu-west-2"
      + role_arn       = (known after apply)
      + rule           = "dev-run-data-pipeline-step-functions-every-week-month-7am"
      + target_id      = "dev-weekly-reports-generator-transfer-level-trigger"
    }

  # aws_cloudwatch_event_target.weekly_transfer_outcomes_per_supplier_pathway_report_event_trigger will be created
  + resource "aws_cloudwatch_event_target" "weekly_transfer_outcomes_per_supplier_pathway_report_event_trigger" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + input          = jsonencode(
            {
              + ALERT_ENABLED            = "false"
              + CONVERSATION_CUTOFF_DAYS = "2"
              + NUMBER_OF_DAYS           = "7"
              + REPORT_NAME              = "TRANSFER_OUTCOMES_PER_SUPPLIER_PATHWAY"
              + SEND_EMAIL_NOTIFICATION  = "true"
            }
        )
      + region         = "eu-west-2"
      + role_arn       = (known after apply)
      + rule           = "dev-run-data-pipeline-step-functions-every-week-month-7am"
      + target_id      = "dev-weekly-reports-generator-transfer-outcomes-trigger"
    }

  # aws_iam_policy.dashboard_pipeline_step_function will be created
  + resource "aws_iam_policy" "dashboard_pipeline_step_function" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "dev-dashboard-pipeline-step-function"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ecr:GetAuthorizationToken"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "GetEcrAuthToken"
                    },
                  + {
                      + Action   = "ecs:RunTask"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecs:eu-west-2:343515223843:task-definition/dev-gp2gp-dashboard:30"
                      + Sid      = "RunEcsTask"
                    },
                  + {
                      + Action   = "lambda:InvokeFunction"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:lambda:eu-west-2:343515223843:function:dev-validate-metrics-lambda"
                      + Sid      = "InvokeValidateMetricsLambdaFunction"
                    },
                  + {
                      + Action   = "lambda:InvokeFunction"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:lambda:eu-west-2:343515223843:function:dev-gp2gp-dashboard-alert-lambda"
                      + Sid      = "InvokeGP2GPDashboardAlertLambdaFunction"
                    },
                  + {
                      + Action   = [
                          + "ecs:StopTask",
                          + "ecs:DescribeTasks",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecs:eu-west-2:343515223843:task-definition/dev-gp2gp-dashboard:30"
                      + Sid      = "StopEcsTask"
                    },
                  + {
                      + Action   = [
                          + "events:PutTargets",
                          + "events:PutRule",
                          + "events:DescribeRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:events:eu-west-2:343515223843:rule/StepFunctionsGetEventsForECSTaskRule"
                      + Sid      = "StepFunctionRule"
                    },
                  + {
                      + Action   = "iam:PassRole"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:iam::343515223843:role/dev-registrations-gp2gp-dashboard",
                          + "arn:aws:iam::343515223843:role/dev-gp2gp-data-pipeline-ecs-execution",
                        ]
                      + Sid      = "PassIamRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_policy.dashboard_pipeline_trigger will be created
  + resource "aws_iam_policy" "dashboard_pipeline_trigger" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "dev-dashboard-pipeline-trigger"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_policy.metrics_calculator_step_function will be created
  + resource "aws_iam_policy" "metrics_calculator_step_function" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "dev-metrics-calculator-step-function"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ecr:GetAuthorizationToken"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "GetEcrAuthToken"
                    },
                  + {
                      + Action   = "ecs:RunTask"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecs:eu-west-2:343515223843:task-definition/dev-metrics-calculator:357"
                      + Sid      = "RunEcsTask"
                    },
                  + {
                      + Action   = [
                          + "ecs:StopTask",
                          + "ecs:DescribeTasks",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecs:eu-west-2:343515223843:task-definition/dev-metrics-calculator:357"
                      + Sid      = "StopEcsTask"
                    },
                  + {
                      + Action   = [
                          + "events:PutTargets",
                          + "events:PutRule",
                          + "events:DescribeRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:events:eu-west-2:343515223843:rule/StepFunctionsGetEventsForECSTaskRule"
                      + Sid      = "StepFunctionRule"
                    },
                  + {
                      + Action   = "iam:PassRole"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:iam::343515223843:role/dev-registrations-metrics-calculator",
                          + "arn:aws:iam::343515223843:role/dev-gp2gp-data-pipeline-ecs-execution",
                        ]
                      + Sid      = "PassIamRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_policy.ods_downloader_step_function will be created
  + resource "aws_iam_policy" "ods_downloader_step_function" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "dev-ods-downloader-step-function"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ecr:GetAuthorizationToken"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "GetEcrAuthToken"
                    },
                  + {
                      + Action   = "ecs:RunTask"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecs:eu-west-2:343515223843:task-definition/dev-ods-downloader:119"
                      + Sid      = "RunEcsTask"
                    },
                  + {
                      + Action   = [
                          + "ecs:StopTask",
                          + "ecs:DescribeTasks",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecs:eu-west-2:343515223843:task-definition/dev-ods-downloader:119"
                      + Sid      = "StopEcsTask"
                    },
                  + {
                      + Action   = [
                          + "events:PutTargets",
                          + "events:PutRule",
                          + "events:DescribeRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:events:eu-west-2:343515223843:rule/StepFunctionsGetEventsForECSTaskRule"
                      + Sid      = "StepFunctionRule"
                    },
                  + {
                      + Action   = "iam:PassRole"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:iam::343515223843:role/dev-registrations-ods-downloader",
                          + "arn:aws:iam::343515223843:role/dev-gp2gp-data-pipeline-ecs-execution",
                        ]
                      + Sid      = "PassIamRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_policy.report_generator_step_function will be created
  + resource "aws_iam_policy" "report_generator_step_function" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "dev-reports-generator-step-function"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ecr:GetAuthorizationToken"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "GetEcrAuthToken"
                    },
                  + {
                      + Action   = "ecs:RunTask"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecs:eu-west-2:343515223843:task-definition/dev-reports-generator:105"
                      + Sid      = "RunEcsTask"
                    },
                  + {
                      + Action   = [
                          + "ecs:StopTask",
                          + "ecs:DescribeTasks",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecs:eu-west-2:343515223843:task-definition/dev-reports-generator:105"
                      + Sid      = "StopEcsTask"
                    },
                  + {
                      + Action   = [
                          + "events:PutTargets",
                          + "events:PutRule",
                          + "events:DescribeRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:events:eu-west-2:343515223843:rule/StepFunctionsGetEventsForECSTaskRule"
                      + Sid      = "StepFunctionRule"
                    },
                  + {
                      + Action   = "iam:PassRole"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:iam::343515223843:role/dev-registrations-reports-generator",
                          + "arn:aws:iam::343515223843:role/dev-gp2gp-data-pipeline-ecs-execution",
                        ]
                      + Sid      = "PassIamRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_policy.reports_generator_trigger will be created
  + resource "aws_iam_policy" "reports_generator_trigger" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "dev-reports-generator-trigger"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_policy.spine_exporter_and_transfer_classifier_trigger will be created
  + resource "aws_iam_policy" "spine_exporter_and_transfer_classifier_trigger" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "dev-daily-spine-exporter-and-transfer-classifier-trigger"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_policy.spine_exporter_step_function will be created
  + resource "aws_iam_policy" "spine_exporter_step_function" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "dev-daily-spine-exporter-step-function"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ecr:GetAuthorizationToken"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "GetEcrAuthToken"
                    },
                  + {
                      + Action   = "ecs:RunTask"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecs:eu-west-2:343515223843:task-definition/dev-spine-exporter:114"
                      + Sid      = "RunEcsTask"
                    },
                  + {
                      + Action   = [
                          + "ecs:StopTask",
                          + "ecs:DescribeTasks",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecs:eu-west-2:343515223843:task-definition/dev-spine-exporter:114"
                      + Sid      = "StopEcsTask"
                    },
                  + {
                      + Action   = [
                          + "events:PutTargets",
                          + "events:PutRule",
                          + "events:DescribeRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:events:eu-west-2:343515223843:rule/StepFunctionsGetEventsForECSTaskRule"
                      + Sid      = "StepFunctionRule"
                    },
                  + {
                      + Action   = "iam:PassRole"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:iam::343515223843:role/dev-registrations-spine-exporter",
                          + "arn:aws:iam::343515223843:role/dev-gp2gp-data-pipeline-ecs-execution",
                        ]
                      + Sid      = "PassIamRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_policy.transfer_classifier_step_function will be created
  + resource "aws_iam_policy" "transfer_classifier_step_function" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "dev-transfer-classifier-step-function"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ecr:GetAuthorizationToken"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "GetEcrAuthToken"
                    },
                  + {
                      + Action   = "ecs:RunTask"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecs:eu-west-2:343515223843:task-definition/dev-transfer-classifier:234"
                      + Sid      = "RunEcsTask"
                    },
                  + {
                      + Action   = [
                          + "ecs:StopTask",
                          + "ecs:DescribeTasks",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecs:eu-west-2:343515223843:task-definition/dev-transfer-classifier:234"
                      + Sid      = "StopEcsTask"
                    },
                  + {
                      + Action   = [
                          + "events:PutTargets",
                          + "events:PutRule",
                          + "events:DescribeRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:events:eu-west-2:343515223843:rule/StepFunctionsGetEventsForECSTaskRule"
                      + Sid      = "StepFunctionRule"
                    },
                  + {
                      + Action   = "iam:PassRole"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:iam::343515223843:role/dev-registrations-transfer-classifier",
                          + "arn:aws:iam::343515223843:role/dev-gp2gp-data-pipeline-ecs-execution",
                        ]
                      + Sid      = "PassIamRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_role.dashboard_pipeline_step_function will be created
  + resource "aws_iam_role" "dashboard_pipeline_step_function" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "states.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "StepFunction role for dashboard pipeline (responsible for deploying FE)"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dev-dashboard-pipeline-step-function"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.dashboard_pipeline_trigger will be created
  + resource "aws_iam_role" "dashboard_pipeline_trigger" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "events.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role used by EventBridge to trigger step function"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dev-dashboard-pipeline-trigger"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.ods_downloader_step_function will be created
  + resource "aws_iam_role" "ods_downloader_step_function" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "states.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "StepFunction role for ODS Downloader"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dev-ods-downloader-step-function"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.report_generator_step_function will be created
  + resource "aws_iam_role" "report_generator_step_function" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "states.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "StepFunction role for reports generator"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dev-reports-generator-step-function"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.reports_generator_trigger will be created
  + resource "aws_iam_role" "reports_generator_trigger" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "events.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role used by EventBridge to trigger step function"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dev-reports-generator-trigger"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.spine_exporter_and_transfer_classifier_step_function will be created
  + resource "aws_iam_role" "spine_exporter_and_transfer_classifier_step_function" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "states.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "StepFunction role for spine exporter and transfer classifier"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dev-spine-exporter-and-transfer-classifier-step-function"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.spine_exporter_and_transfer_classifier_trigger will be created
  + resource "aws_iam_role" "spine_exporter_and_transfer_classifier_trigger" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "events.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role used by EventBridge to trigger step function"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dev-daily-spine-exporter-and-transfer-classifier-trigger"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.transfer_classifier_step_function will be created
  + resource "aws_iam_role" "transfer_classifier_step_function" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "states.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "StepFunction role for transfer classifier"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dev-transfer-classifier-step-function"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.dashboard_pipeline_step_function will be created
  + resource "aws_iam_role_policy_attachment" "dashboard_pipeline_step_function" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dev-dashboard-pipeline-step-function"
    }

  # aws_iam_role_policy_attachment.dashboard_pipeline_step_function_metrics_calculater_step_function will be created
  + resource "aws_iam_role_policy_attachment" "dashboard_pipeline_step_function_metrics_calculater_step_function" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dev-dashboard-pipeline-step-function"
    }

  # aws_iam_role_policy_attachment.dashboard_pipeline_trigger will be created
  + resource "aws_iam_role_policy_attachment" "dashboard_pipeline_trigger" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dev-dashboard-pipeline-trigger"
    }

  # aws_iam_role_policy_attachment.ods_downloader_step_function will be created
  + resource "aws_iam_role_policy_attachment" "ods_downloader_step_function" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dev-ods-downloader-step-function"
    }

  # aws_iam_role_policy_attachment.report_generator_step_function will be created
  + resource "aws_iam_role_policy_attachment" "report_generator_step_function" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dev-reports-generator-step-function"
    }

  # aws_iam_role_policy_attachment.reports_generator_trigger will be created
  + resource "aws_iam_role_policy_attachment" "reports_generator_trigger" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dev-reports-generator-trigger"
    }

  # aws_iam_role_policy_attachment.spine_exporter_and_transfer_classifier_step_function will be created
  + resource "aws_iam_role_policy_attachment" "spine_exporter_and_transfer_classifier_step_function" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dev-spine-exporter-and-transfer-classifier-step-function"
    }

  # aws_iam_role_policy_attachment.spine_exporter_and_transfer_classifier_trigger will be created
  + resource "aws_iam_role_policy_attachment" "spine_exporter_and_transfer_classifier_trigger" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dev-daily-spine-exporter-and-transfer-classifier-trigger"
    }

  # aws_iam_role_policy_attachment.spine_exporter_step_function will be created
  + resource "aws_iam_role_policy_attachment" "spine_exporter_step_function" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dev-spine-exporter-and-transfer-classifier-step-function"
    }

  # aws_iam_role_policy_attachment.transfer_classifier_step_function will be created
  + resource "aws_iam_role_policy_attachment" "transfer_classifier_step_function" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dev-transfer-classifier-step-function"
    }

  # aws_sfn_state_machine.dashboard_pipeline will be created
  + resource "aws_sfn_state_machine" "dashboard_pipeline" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = (sensitive value)
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "dashboard-pipeline"
      + name_prefix               = (known after apply)
      + publish                   = false
      + region                    = "eu-west-2"
      + revision_id               = (known after apply)
      + role_arn                  = (known after apply)
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "ApplicationRole"     = "AwsSfnStateMachine"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-dashboard-pipeline-step-function"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + tags_all                  = {
          + "ApplicationRole"     = "AwsSfnStateMachine"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-dashboard-pipeline-step-function"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)

      + encryption_configuration (known after apply)

      + logging_configuration (known after apply)

      + tracing_configuration (known after apply)
    }

  # aws_sfn_state_machine.ods_downloader will be created
  + resource "aws_sfn_state_machine" "ods_downloader" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = (sensitive value)
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "ods-downloader-pipeline"
      + name_prefix               = (known after apply)
      + publish                   = false
      + region                    = "eu-west-2"
      + revision_id               = (known after apply)
      + role_arn                  = (known after apply)
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "ApplicationRole"     = "AwsSfnStateMachine"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-ods-downloader-pipeline-step-function"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + tags_all                  = {
          + "ApplicationRole"     = "AwsSfnStateMachine"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-ods-downloader-pipeline-step-function"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)

      + encryption_configuration (known after apply)

      + logging_configuration (known after apply)

      + tracing_configuration (known after apply)
    }

  # aws_sfn_state_machine.reports_generator will be created
  + resource "aws_sfn_state_machine" "reports_generator" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = (sensitive value)
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "reports-generator"
      + name_prefix               = (known after apply)
      + publish                   = false
      + region                    = "eu-west-2"
      + revision_id               = (known after apply)
      + role_arn                  = (known after apply)
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "ApplicationRole"     = "AwsSfnStateMachine"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-reports-generator-step-function"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + tags_all                  = {
          + "ApplicationRole"     = "AwsSfnStateMachine"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-reports-generator-step-function"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)

      + encryption_configuration (known after apply)

      + logging_configuration (known after apply)

      + tracing_configuration (known after apply)
    }

  # aws_sfn_state_machine.spine_exporter_and_transfer_classifier will be created
  + resource "aws_sfn_state_machine" "spine_exporter_and_transfer_classifier" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = (sensitive value)
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "daily-spine-exporter-and-transfer-classifier"
      + name_prefix               = (known after apply)
      + publish                   = false
      + region                    = "eu-west-2"
      + revision_id               = (known after apply)
      + role_arn                  = (known after apply)
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "ApplicationRole"     = "AwsSfnStateMachine"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-spine-exporter-and-transfer-classifier-step-function"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + tags_all                  = {
          + "ApplicationRole"     = "AwsSfnStateMachine"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-spine-exporter-and-transfer-classifier-step-function"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)

      + encryption_configuration (known after apply)

      + logging_configuration (known after apply)

      + tracing_configuration (known after apply)
    }

  # aws_sfn_state_machine.transfer_classifier will be created
  + resource "aws_sfn_state_machine" "transfer_classifier" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = (sensitive value)
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "transfer-classifier-manual"
      + name_prefix               = (known after apply)
      + publish                   = false
      + region                    = "eu-west-2"
      + revision_id               = (known after apply)
      + role_arn                  = (known after apply)
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "ApplicationRole"     = "AwsSfnStateMachine"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-transfer-classifier-step-function-manual-run"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + tags_all                  = {
          + "ApplicationRole"     = "AwsSfnStateMachine"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-transfer-classifier-step-function-manual-run"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)

      + encryption_configuration (known after apply)

      + logging_configuration (known after apply)

      + tracing_configuration (known after apply)
    }

Plan: 47 to add, 0 to change, 0 to destroy.

```

</details>